test/fio-outputs/bs16k-read.txt
warmup: (g=0): rw=read, bs=(R) 16.0KiB-16.0KiB, (W) 16.0KiB-16.0KiB, (T) 16.0KiB-16.0KiB, ioengine=xnvme, iodepth=1
bs16k-read: (g=1): rw=read, bs=(R) 16.0KiB-16.0KiB, (W) 16.0KiB-16.0KiB, (T) 16.0KiB-16.0KiB, ioengine=xnvme, iodepth=1
fio-3.20-90-g5bd52
Starting 2 threads
xnvme_fioe: init(): td->io_ops: 0x7f8923011320
xnvme_fioe: init(): td->io_ops: 0x7f8923011320

warmup: (groupid=0, jobs=1): err= 0: pid=18212: Sun Feb 28 17:18:18 2021
  read: IOPS=65.8k, BW=1028MiB/s (1078MB/s)(914GiB/910856msec)
    clat (nsec): min=149, max=580608, avg=11153.40, stdev=313.92
     lat (nsec): min=14047, max=584188, avg=14714.05, stdev=353.01
    clat percentiles (nsec):
     |  1.00th=[10816],  5.00th=[10816], 10.00th=[10944], 20.00th=[10944],
     | 30.00th=[11072], 40.00th=[11072], 50.00th=[11072], 60.00th=[11200],
     | 70.00th=[11200], 80.00th=[11328], 90.00th=[11456], 95.00th=[11456],
     | 99.00th=[11968], 99.50th=[12480], 99.90th=[14016], 99.95th=[14272],
     | 99.99th=[14656]
   bw (  MiB/s): min= 1015, max= 1032, per=100.00%, avg=1028.83, stdev= 2.20, samples=1317
   iops        : min=65007, max=66072, avg=65844.93, stdev=140.93, samples=1317
  lat (nsec)   : 250=0.01%, 500=0.01%
  lat (usec)   : 4=0.01%, 10=0.08%, 20=99.92%, 50=0.01%, 100=0.01%
  lat (usec)   : 250=0.01%, 500=0.01%, 750=0.01%
  cpu          : usr=82.04%, sys=17.96%, ctx=1178, majf=0, minf=1204
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=59910946,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
  steadystate  : attained=yes, bw=1028MiB/s (1053MB/s), iops=65.8k, iops slope=0.000%
bs16k-read: (groupid=1, jobs=1): err= 0: pid=18319: Sun Feb 28 17:18:18 2021
  read: IOPS=64.6k, BW=1010MiB/s (1059MB/s)(887GiB/900000msec)
    clat (nsec): min=149, max=1786.9k, avg=11263.05, stdev=1484.83
     lat (usec): min=14, max=1790, avg=14.87, stdev= 1.72
    clat percentiles (nsec):
     |  1.00th=[10816],  5.00th=[10944], 10.00th=[10944], 20.00th=[11072],
     | 30.00th=[11072], 40.00th=[11200], 50.00th=[11200], 60.00th=[11328],
     | 70.00th=[11328], 80.00th=[11456], 90.00th=[11584], 95.00th=[11712],
     | 99.00th=[12608], 99.50th=[13632], 99.90th=[14400], 99.95th=[14656],
     | 99.99th=[15424]
   bw (  KiB/s): min=1026048, max=1040512, per=100.00%, avg=1034990.74, stdev=2052.92, samples=1797
   iops        : min=64128, max=65032, avg=64686.91, stdev=128.30, samples=1797
  lat (nsec)   : 250=0.01%, 500=0.01%, 750=0.01%, 1000=0.01%
  lat (usec)   : 4=0.01%, 10=0.07%, 20=99.92%, 50=0.01%, 100=0.01%
  lat (usec)   : 250=0.01%, 500=0.01%, 750=0.01%, 1000=0.01%
  lat (msec)   : 2=0.01%
  cpu          : usr=79.38%, sys=20.62%, ctx=3341, majf=0, minf=910253
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=58151357,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=1028MiB/s (1078MB/s), 1028MiB/s-1028MiB/s (1078MB/s-1078MB/s), io=914GiB (982GB), run=910856-910856msec

Run status group 1 (all jobs):
   READ: bw=1010MiB/s (1059MB/s), 1010MiB/s-1010MiB/s (1059MB/s-1059MB/s), io=887GiB (953GB), run=900000-900000msec