test/fio-outputs/bs4k-read.txt
warmup: (g=0): rw=read, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=xnvme, iodepth=1
bs4k-read: (g=1): rw=read, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=xnvme, iodepth=1
fio-3.20-90-g5bd52
Starting 2 threads
xnvme_fioe: init(): td->io_ops: 0x7fbf97844320
xnvme_fioe: init(): td->io_ops: 0x7fbf97844320

warmup: (groupid=0, jobs=1): err= 0: pid=19206: Sun Feb 28 20:07:14 2021
  read: IOPS=88.0k, BW=347MiB/s (364MB/s)(309GiB/910856msec)
    clat (nsec): min=85, max=454765, avg=8195.45, stdev=1016.28
     lat (usec): min=9, max=457, avg=10.90, stdev= 1.02
    clat percentiles (nsec):
     |  1.00th=[ 6944],  5.00th=[ 7072], 10.00th=[ 7136], 20.00th=[ 7200],
     | 30.00th=[ 7264], 40.00th=[ 7328], 50.00th=[ 7584], 60.00th=[ 9024],
     | 70.00th=[ 9152], 80.00th=[ 9280], 90.00th=[ 9408], 95.00th=[ 9536],
     | 99.00th=[ 9792], 99.50th=[10048], 99.90th=[11712], 99.95th=[12096],
     | 99.99th=[12608]
   bw (  KiB/s): min=352719, max=356849, per=100.00%, avg=356208.82, stdev=231.18, samples=1314
   iops        : min=88179, max=89212, avg=89051.95, stdev=57.82, samples=1314
  lat (nsec)   : 100=0.01%, 250=0.01%, 500=0.01%
  lat (usec)   : 4=0.01%, 10=99.40%, 20=0.60%, 50=0.01%, 100=0.01%
  lat (usec)   : 250=0.01%, 500=0.01%
  cpu          : usr=84.16%, sys=15.83%, ctx=1825, majf=0, minf=961
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=81025993,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
  steadystate  : attained=yes, bw=348MiB/s (356MB/s), iops=88.0k, iops slope=0.000%
bs4k-read: (groupid=1, jobs=1): err= 0: pid=19293: Sun Feb 28 20:07:14 2021
  read: IOPS=87.1k, BW=340MiB/s (357MB/s)(299GiB/900000msec)
    clat (nsec): min=109, max=1814.5k, avg=8309.05, stdev=1910.80
     lat (usec): min=9, max=1817, avg=11.03, stdev= 2.10
    clat percentiles (nsec):
     |  1.00th=[ 6944],  5.00th=[ 7072], 10.00th=[ 7136], 20.00th=[ 7264],
     | 30.00th=[ 7328], 40.00th=[ 7392], 50.00th=[ 7648], 60.00th=[ 9152],
     | 70.00th=[ 9280], 80.00th=[ 9408], 90.00th=[ 9664], 95.00th=[ 9792],
     | 99.00th=[10048], 99.50th=[10304], 99.90th=[12096], 99.95th=[12480],
     | 99.99th=[13120]
   bw (  KiB/s): min=344480, max=349720, per=100.00%, avg=348942.06, stdev=352.30, samples=1797
   iops        : min=86120, max=87430, avg=87235.49, stdev=88.07, samples=1797
  lat (nsec)   : 250=0.01%, 500=0.01%, 750=0.01%, 1000=0.01%
  lat (usec)   : 2=0.01%, 4=0.01%, 10=98.53%, 20=1.46%, 50=0.01%
  lat (usec)   : 100=0.01%, 250=0.01%, 500=0.01%, 750=0.01%, 1000=0.01%
  lat (msec)   : 2=0.01%
  cpu          : usr=81.37%, sys=18.62%, ctx=3009, majf=0, minf=1226881
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=78421883,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=347MiB/s (364MB/s), 347MiB/s-347MiB/s (364MB/s-364MB/s), io=309GiB (332GB), run=910856-910856msec

Run status group 1 (all jobs):
   READ: bw=340MiB/s (357MB/s), 340MiB/s-340MiB/s (357MB/s-357MB/s), io=299GiB (321GB), run=900000-900000msec